'#---------------------BS_STVARS_012_01----------------------#'
SELECT COUNT(@@GLOBAL.have_ndbcluster);
COUNT(@@GLOBAL.have_ndbcluster)
1
1 Expected
'#---------------------BS_STVARS_012_02----------------------#'
SET @@GLOBAL.have_ndbcluster=1;
ERROR HY000: Variable 'have_ndbcluster' is a read only variable
Expected error 'Read only variable'
SELECT COUNT(@@GLOBAL.have_ndbcluster);
COUNT(@@GLOBAL.have_ndbcluster)
1
1 Expected
'#---------------------BS_STVARS_012_03----------------------#'
SELECT @@GLOBAL.have_ndbcluster = VARIABLE_VALUE
FROM INFORMATION_SCHEMA.GLOBAL_VARIABLES
WHERE VARIABLE_NAME='have_ndbcluster';
@@GLOBAL.have_ndbcluster = VARIABLE_VALUE
1
1 Expected
SELECT COUNT(@@GLOBAL.have_ndbcluster);
COUNT(@@GLOBAL.have_ndbcluster)
1
1 Expected
SELECT COUNT(VARIABLE_VALUE)
FROM INFORMATION_SCHEMA.GLOBAL_VARIABLES 
WHERE VARIABLE_NAME='have_ndbcluster';
COUNT(VARIABLE_VALUE)
1
1 Expected
'#---------------------BS_STVARS_012_04----------------------#'
SELECT @@have_ndbcluster = @@GLOBAL.have_ndbcluster;
@@have_ndbcluster = @@GLOBAL.have_ndbcluster
1
1 Expected
'#---------------------BS_STVARS_012_05----------------------#'
SELECT COUNT(@@have_ndbcluster);
COUNT(@@have_ndbcluster)
1
1 Expected
SELECT COUNT(@@local.have_ndbcluster);
ERROR HY000: Variable 'have_ndbcluster' is a GLOBAL variable
Expected error 'Variable is a GLOBAL variable'
SELECT COUNT(@@SESSION.have_ndbcluster);
ERROR HY000: Variable 'have_ndbcluster' is a GLOBAL variable
Expected error 'Variable is a GLOBAL variable'
SELECT COUNT(@@GLOBAL.have_ndbcluster);
COUNT(@@GLOBAL.have_ndbcluster)
1
1 Expected
SELECT have_ndbcluster = @@SESSION.have_ndbcluster;
ERROR 42S22: Unknown column 'have_ndbcluster' in 'field list'
Expected error 'Readonly variable'
